
export default class Student {
    #careerList;
    #completedSubjectList;

    constructor() {
        this.#careerList = [
            {"이수학점":78}, 
            {"평점":4.03}, 
            {"교양":6}, 
            {"기본소양": 9}, 
            {"전공기반": 18}, 
            {"공학전공": 42},
            {"영어성적": "pass"}, 
            {"현장실습": 3}, 
            {"공학상담": 6} 
        ];
        this.#completedSubjectList = 
        [
            { "교과목번호": "CLTR003", "개설학과": "컴퓨터학부", "교과목명": "실용화법", "교과구분": "기본소양", "학점": "3", "학기": "2016.1", "평점": "A+", "재이수": "" },
            { "교과목번호": "CLTR213", "개설학과": "컴퓨터학부", "교과목명": "물리학 I", "교과구분": "전공기반", "학점": "3", "학기": "2016.1", "평점": "A0", "재이수": "" },
            { "교과목번호": "CLTR225", "개설학과": "기초교육원", "교과목명": "기초수학", "교과구분": "교양", "학점": "3", "학기": "2016.1", "평점": "S", "재이수": "" },
            { "교과목번호": "CLTR263", "개설학과": "컴퓨터학부", "교과목명": "문화 기술 개론", "교과구분": "기본소양", "학점": "3", "학기": "2016.1", "평점": "A+", "재이수": "" },
            { "교과목번호": "COMP209", "개설학과": "컴퓨터학부", "교과목명": "소프트웨어와 문제해결", "교과구분": "공학전공", "학점": "3", "학기": "2016.1", "평점": "A-", "재이수": "" }, 
            { "교과목번호": "ITEC201", "개설학과": "컴퓨터학부", "교과목명": "컴퓨터학개론", "교과구분": "공학전공", "학점": "3", "학기": "2016.1", "평점": "B+", "재이수": "" }, 
            { "교과목번호": "CLTR211", "개설학과": "수학과", "교과목명": "수학 I", "교과구분": "전공기반", "학점": "3", "학기": "2016.S", "평점": "A0", "재이수": "" }, 
            { "교과목번호": "COMP206", "개설학과": "컴퓨터학부", "교과목명": "기초프로그래밍", "교과구분": "공학전공", "학점": "3", "학기": "2016.2", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "COMP205", "개설학과": "컴퓨터학부", "교과목명": "기초창의공학설계", "교과구분": "공학전공", "학점": "3", "학기": "2016.2", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "COME301", "개설학과": "컴퓨터학부", "교과목명": "이산수학", "교과구분": "전공기반", "학점": "3", "학기": "2016.2", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "COMP207", "개설학과": "컴퓨터학부", "교과목명": "기초프로그래밍실습", "교과구분": "공학전공", "학점": "3", "학기": "2016.2", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "COMP208", "개설학과": "컴퓨터학부", "교과목명": "기초공학물리학실험", "교과구분": "전공기반", "학점": "3", "학기": "2016.2", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "CLTR264", "개설학과": "컴퓨터학부", "교과목명": "소셜네트워크", "교과구분": "기본소양", "학점": "3", "학기": "2016.2", "평점": "B+", "재이수": "" }, 
            { "교과목번호": "COMP217", "개설학과": "컴퓨터학부", "교과목명": "자바프로그래밍", "교과구분": "공학전공", "학점": "3", "학기": "2019.1", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "COMP216", "개설학과": "컴퓨터학부", "교과목명": "자료구조응용", "교과구분": "공학전공", "학점": "3", "학기": "2019.1", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "COME331", "개설학과": "컴퓨터학부", "교과목명": "자료구조", "교과구분": "공학전공", "학점": "3", "학기": "2019.1", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "COMP315", "개설학과": "컴퓨터학부", "교과목명": "오토마타및형식언어", "교과구분": "공학전공", "학점": "3", "학기": "2019.1", "평점": "A0", "재이수": "" }, 
            { "교과목번호": "ENGR211", "개설학과": "컴퓨터학부", "교과목명": "공학수학 1", "교과구분": "전공기반", "학점": "3", "학기": "2019.1", "평점": "B+", "재이수": "" }, 
            { "교과목번호": "ELEC247", "개설학과": "컴퓨터학부", "교과목명": "논리회로", "교과구분": "공학전공", "학점": "3", "학기": "2019.1", "평점": "A0", "재이수": "" }, 
            { "교과목번호": "OVIN207", "개설학과": "", "교과목명": "해외인턴5", "교과구분": "전공", "학점": "3", "학기": "2019.S", "평점": "S", "재이수": "" }, 
            { "교과목번호": "CLTR205", "개설학과": "글로벌소프트웨어융합전공", "교과목명": "대학글쓰기", "교과구분": "교양", "학점": "3", "학기": "2019.2", "평점": "A0", "재이수": "" }, 
            { "교과목번호": "COMP224", "개설학과": "컴퓨터학부", "교과목명": "소프트웨어설계", "교과구분": "공학전공", "학점": "3", "학기": "2019.2", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "COMP411", "개설학과": "컴퓨터학부", "교과목명": "컴퓨터구조", "교과구분": "공학전공", "학점": "3", "학기": "2019.2", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "ELEC462", "개설학과": "컴퓨터학부", "교과목명": "시스템프로그래밍", "교과구분": "공학전공", "학점": "3", "학기": "2019.2", "평점": "A+", "재이수": "" }, 
            { "교과목번호": "MTED231", "개설학과": "컴퓨터학부", "교과목명": "선형대수", "교과구분": "전공기반", "학점": "3", "학기": "2019.2", "평점": "B+", "재이수": "" }           
        ];
    }

    getCareerList = function () {
        return this.#careerList;
    }
    setCareerList = function (json) {
        this.#careerList = json;
    }
    getCompletedSubjectList = function () {
        return this.#completedSubjectList;
    }
    setCompletedSubjectList = function (json) {
        this.#completedSubjectList = json;
    }
}