const designSubjectList = [
    {"교과목번호":"COMP205","개설학과":null,"교과목명":"기초창의공학설계","교과구분":null,"학점":2},
    {"교과목번호":"COMP217","개설학과":null,"교과목명":"자바프로그래밍","교과구분":null,"학점":2},
    {"교과목번호":"ELEC462","개설학과":null,"교과목명":"시스템프로그래밍","교과구분":null,"학점":2},
    {"교과목번호":"COMP224","개설학과":null,"교과목명":"소프트웨어설계","교과구분":null,"학점":2},
    {"교과목번호":"COMP225","개설학과":null,"교과목명":"디지털설계및실험","교과구분":null,"학점":2},
    {"교과목번호":"COMP422","개설학과":null,"교과목명":"소프트웨어공학","교과구분":null,"학점":2},
    {"교과목번호":"ITEC401","개설학과":null,"교과목명":"종합설계프로젝트1","교과구분":null,"학점":4},
    {"교과목번호":"ITEC402","개설학과":null,"교과목명":"종합설계프로젝트2","교과구분":null,"학점":4}
];
