const graduationInfoLists = {
    "심화컴퓨터전공(ABEEK)":
    {
        "이수학점":150,
        "기본소양":15,
        "전공기반":22,
        "공학전공":75,
        "공학인증":112,
        "영어성적":"토익700점",
        "현장실습":3,
        "공학상담":8,
        "설계과목":16
    },
    "글로벌소프트웨어전공(다중전공트랙)" :
    {
        "이수학점":130,
        "교양":24,
        "전공":51,
        "스타트업":"창업",
        "창업역량":9,
        "해외역량":9,
        "영어성적":"토익700점",
        "현장실습":3,
        "상담":4,
        "융합전공":36,
        "연계전공":45,
        "복수전공":51,
        "부전공":21,
        "첨성인기초":3,
        "첨성인핵심-인문사회":3,
        "첨성인핵심-자연과학":3,
        "인문교양":8
    },
    "글로벌소프트웨어전공(해외복수학위트랙)" :
    {
        "이수학점":130,
        "교양":24,
        "전공":51,
        "창업역량":3,
        "해외역량":"복수학위취득",
        "영어성적":"토익800점",
        "상담":4,
        "첨성인기초":3,
        "첨성인핵심-인문사회":3,
        "첨성인핵심-자연과학":3,
        "인문교양":8
    },
    "글로벌소프트웨어전공(학석사연계트랙)" :
    {
        "이수학점":130,
        "교양":24,
        "전공":51,
        "해외역량":6,
        "영어성적":"토익800점",
        "현장실습":3,
        "상담":4,
        "첨성인기초":3,
        "첨성인핵심-인문사회":3,
        "첨성인핵심-자연과학":3,
        "인문교양":8
    },
    "핀테크전공" :
    {
        "연계전공":45,
        "SW필수":15,
        "SW교양":6
    },
    "빅데이터전공" : 
    {
        "연계전공":45,
        "SW필수":15,
        "SW교양":6
    },
    "미디어아트" : 
    {
        "연계전공":45,
        "SW필수":15,
        "SW교양":6
    },
    "건설IT전공" : 
    {
        "연계전공":45,
        "SW필수":15,
        "SW교양":6
    }

}

export default graduationInfoLists;