export default requiredSubjectList = {
    "테스트용입니다" :[
        {"교과목번호":"CLTR211","개설학과":null,"교과목명":"수학 I","교과구분":"전공기반","학점":3,"대체교과목번호":""},
    ],
    "심화컴퓨터전공(ABEEK)" : 
    [   
        {"교과목번호":"CLTR211","개설학과":null,"교과목명":"수학 I","교과구분":"전공기반","학점":3,"대체교과목번호":""},
        {"교과목번호":"CLTR213","개설학과":null,"교과목명":"물리학 I","교과구분":"전공기반","학점":3,"대체교과목번호":""},
        {"교과목번호":"COMP208","개설학과":null,"교과목명":"기초공학물리학실험","교과구분":"전공기반","학점":3,"대체교과목번호":"CLTR223"},
        {"교과목번호":"COMP206","개설학과":null,"교과목명":"기초프로그래밍","교과구분":"공학전공","학점":3,"대체교과목번호":"COMP204"},
        {"교과목번호":"COMP325","개설학과":null,"교과목명":"알고리즘","교과구분":"공학전공","학점":3,"대체교과목번호":"COMP319"},
        {"교과목번호":"CLTR223","개설학과":null,"교과목명":"물리학실험 I","교과구분":"전공기반","학점":1,"대체교과목번호":""},
        {"교과목번호":"COME301","개설학과":null,"교과목명":"이산수학","교과구분":"전공기반","학점":3,"대체교과목번호":""},
        {"교과목번호":"COMP205","개설학과":null,"교과목명":"기초창의공학설계","교과구분":"공학전공","학점":3,"대체교과목번호":""},
        {"교과목번호":"COMP204","개설학과":null,"교과목명":"프로그래밍기초","교과구분":"공학전공","학점":6,"대체교과목번호":""},
        {"교과목번호":"COME331","개설학과":null,"교과목명":"자료구조","교과구분":"공학전공","학점":3,"대체교과목번호":""},
        {"교과목번호":"COMP217","개설학과":null,"교과목명":"자바프로그래밍","교과구분":"공학전공","학점":3,"대체교과목번호":""},
        {"교과목번호":"ELEC462","개설학과":null,"교과목명":"시스템프로그래밍","교과구분":"공학전공","학점":3,"대체교과목번호":""},
        {"교과목번호":"COMP411","개설학과":null,"교과목명":"컴퓨터구조","교과구분":"공학전공","학점":3,"대체교과목번호":""},
        {"교과목번호":"COMP319","개설학과":null,"교과목명":"알고리즘1","교과구분":"공학전공","학점":3,"대체교과목번호":""},
        {"교과목번호":"COMP312","개설학과":null,"교과목명":"운영체제","교과구분":"공학전공","학점":3,"대체교과목번호":""},
        {"교과목번호":"ITEC401","개설학과":null,"교과목명":"종합설계프로젝트1","교과구분":"공학전공","학점":4,"대체교과목번호":""},
        {"교과목번호":"ITEC402","개설학과":null,"교과목명":"종합설계프로젝트2","교과구분":"공학전공","학점":4,"대체교과목번호":""}
    ],
    "글로벌소프트웨어전공(다중전공트랙)" :
    [
        {"교과목번호":"COMP204","개설학과":null,"교과목명":"프로그래밍기초","교과구분":"전공","학점":6,"대체교과목번호":null},
        {"교과목번호":"COME331","개설학과":null,"교과목명":"자료구조","교과구분":"전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"GLSO216","개설학과":null,"교과목명":"알고리즘실습","교과구분":"전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP312","개설학과":null,"교과목명":"운영체제","교과구분":"전공","학점":3,"대체교과목번호":null}
    ],
    "글로벌소프트웨어전공(해외복수학위트랙)" :
    [
        {"교과목번호":"COMP204","개설학과":null,"교과목명":"프로그래밍기초","교과구분":"전공","학점":6,"대체교과목번호":null},
        {"교과목번호":"COME331","개설학과":null,"교과목명":"자료구조","교과구분":"전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"GLSO216","개설학과":null,"교과목명":"알고리즘실습","교과구분":"전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP312","개설학과":null,"교과목명":"운영체제","교과구분":"전공","학점":3,"대체교과목번호":null}
    ],
    "글로벌소프트웨어전공(학석사연계트랙)" :
    [
        {"교과목번호":"COMP204","개설학과":null,"교과목명":"프로그래밍기초","교과구분":"전공","학점":6,"대체교과목번호":null},
        {"교과목번호":"COME331","개설학과":null,"교과목명":"자료구조","교과구분":"전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"GLSO216","개설학과":null,"교과목명":"알고리즘실습","교과구분":"전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP312","개설학과":null,"교과목명":"운영체제","교과구분":"전공","학점":3,"대체교과목번호":null}
    ],
    "연계전공공통교육과정" :
    [
        {"교과목번호":"COMP206","개설학과":null,"교과목명":"기초프로그래밍","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COME331","개설학과":null,"교과목명":"자료구조","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP217","개설학과":null,"교과목명":"자바프로그래밍","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COME368","개설학과":null,"교과목명":"정보보호론","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP428","개설학과":null,"교과목명":"IT기술경영개론","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP600","개설학과":null,"교과목명":"소프트웨어융합프로젝트","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"ITEC201","개설학과":null,"교과목명":"컴퓨터학개론","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP413","개설학과":null,"교과목명":"컴퓨터그래픽스","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP414","개설학과":null,"교과목명":"컴퓨터망","교과구분":"융합전공","학점":3,"대체교과목번호":null},
        {"교과목번호":"COMP419","개설학과":null,"교과목명":"정보검색","교과구분":"융합전공","학점":3,"대체교과목번호":null}
    ],
    "연계전공교양교육과정" :
    [
        {"교과목번호":"CLTR195","개설학과":null,"교과목명":"C/C++프로그래밍기초","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR262","개설학과":null,"교과목명":"SW와 문제해결 기초","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR263","개설학과":null,"교과목명":"문화 기술 개론","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR266","개설학과":null,"교과목명":"SW 사고기법","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR270","개설학과":null,"교과목명":"SW 컨텐츠 제작","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR372","개설학과":null,"교과목명":"인공지능의 이해","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR373","개설학과":null,"교과목명":"빅데이터 기초 실습","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR264","개설학과":null,"교과목명":"소셜네트워크","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR267","개설학과":null,"교과목명":"웹 프로그래밍 기초","교과구분":null,"학점":3,"대체교과목번호":null},
        {"교과목번호":"CLTR268","개설학과":null,"교과목명":"파이선 프로그래밍","교과구분":null,"학점":3,"대체교과목번호":null}
    ]
};
